clear;
[myinfo,color]=config();

a=[14793.872  11178.387  9574.145  8933.67  5274.695];
b=[14793.835  11178.26  9563.34  8933.67  1898.27];
c=[a;b]';
figure(1)
bar(c)
legend('产生量（吨)','处置量')
set(gca,'xticklabel',{'废碱';'废酸';'有机树脂类废物';'有机溶剂废物';'精（蒸）馏残渣'})
title('兰州市 2015 年不同工业废物种类的产生量和处置量条形图')
figure(2)
y=[24.28  18.35  15.71  14.66  8.66];
pie3(y)
title('兰州市 2015 年工业废物种类的比例');
legend('废碱%','废酸%','有机树脂类废物%','有机溶剂废物%','精（蒸）馏残渣%')
figure(3)
d1=[182.13  160.52  73.22  102.83  23.45];
d2=[182.13  160.52  73.12  98.21  21.44];
d=[d1;d2]';
bar(d)
legend('产生量（吨)','综合利用量')
set(gca,'xticklabel',{'废碱';'废酸';'有机树脂类废物';'有机溶剂废物';'精（蒸）馏残渣'})
title('不同种类的工业固废的产生量、综合利用量之间的差异关系条形图')
suptitle(myinfo)
