clear;
[myinfo,color]=config();

years=[1970 1980 1990 2000 2004 2008 2012];
y=[0.47,1.37,0,0,10.33,0.83;21.51,43.53,0,0,37.84,3.04;22.75,44.6,32.21,19.81,46.92,3.77;100.47,187.19,187.82,167.33,110.65,8.89;116.25,229.65,255.15,235.12,255.58,12.5;303.56,34,233,222,123,567;222,345,346,234,345,865];
for i=1:7
    subplot(3,3,i);
    pie3(y(i,:));
%     legend('铁精矿','生铁','粗钢','钢加工产品','焦炭','煤化工产品');
    title(years(i));
end
suptitle(myinfo);
legend('铁精矿','生铁','粗钢','钢加工产品','焦炭','煤化工产品');

% yy=sum(y);
% pie3(yy);
% legend(string(years));
% title(myinfo);