clear;
[myinfo,color]=config();

%1
%设A生产产品1为x1，生产产品2为x2，生产产品3为x3；B生产1产品为x4，生产产品2为x5，生产产品3为x6；C生产1产品为x7，生产产品2为x8，生产产品3为x9
%目标函数：maxf=3*(x1+x4+x7)+2*(x2+x5+x8)+2.9*(x3+x6+x9);
%约束条件：8*x1+2*x2+10*x3≤300;10*x4+5*x5+8*x6≤400;2*x7+13*x8+10*x9≤420;x1,x2,x3,x4,x5,x6,x7,x8,x9≥0.
% c=[-3 -2 -2.9 -3 -2 -2.9 -3 -2 -2.9];
% A=[8 2 10 0 0 0 0 0 0;0 0 0 10 5 8 0 0 0;0 0 0 0 0 0 2 13 10];
% b=[300;400;420];
% Aeq=[];
% beq=[];
% vlb=zeros(9,1);
% vub=[];
% [x fval]=linprog(c,A,b,Aeq,beq,vlb,vub)

%2
%设A生产产品1为x1，生产产品2为x2，生产产品3为x3；B生产1产品为x4，生产产品2为x5，生产产品3为x6；C生产1产品为x7，生产产品2为x8，生产产品3为x9
%目标函数：maxf=3*(x1+x4+x7)+2*(x2+x5+x8)+2.9*(x3+x6+x9)+18;
%约束条件：8*x1+2*x2+10*x3≤300;10*x4+5*x5+8*x6≤460;2*x7+13*x8+10*x9≤420;x1,x2,x3,x4,x5,x6,x7,x8,x9≥0.
% c=[-3 -2 -2.9 -3 -2 -2.9 -3 -2 -2.9];
% A=[8 2 10 0 0 0 0 0 0;0 0 0 10 5 8 0 0 0;0 0 0 0 0 0 2 13 10];
% b=[300;460;420];
% Aeq=[];
% beq=[];
% vlb=zeros(9,1);
% vub=[];
% [x fval]=linprog(c,A,b,Aeq,beq,vlb,vub)
% fvall=fval+18

%3
%设A生产产品1为x1，生产产品2为x2，生产产品3为x3，生产产品4为x4，生产产品5为x5；B生产产品1为x6，生产产品2为x7，生产产品3为x8，生产产品4为x9，生产产品5为x10；C生产产品1为x11，生产产品2为x12，生产产品3为x13，生产产品4为x14，生产产品5为x15；
%目标函数：maxf=3*(x1+x6+x11)+2*(x2+x7+x12)+2.9*(x3+x8+x13)+2.1*(x4+x9+x14)+1.87*(x5+x10+x15);
%约束条件：8*x1+2*x2+10*x3+12*x4+4*x5≤300;10*x6+5*x7+8*x8+5*x9+4*x10≤400;2*x11+13*x12+10*x13+10*x14+12*x15≤420;x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15≥0.
% c=[-3 -2 -2.9 -2.1 -1.87 -3 -2 -2.9 -2.1 -1.87 -3 -2 -2.9 -2.1 -1.87];
% A=[8 2 10 12 4 0 0 0 0 0 0 0 0 0 0;0 0 0 0 0 10 5 8 5 4 0 0 0 0 0;0 0 0 0 0 0 0 0 0 0 2 13 10 10 12];
% b=[300;400;420];
% Aeq=[];
% beq=[];
% vlb=zeros(15,1);
% vub=[];
% [x fval]=linprog(c,A,b,Aeq,beq,vlb,vub)

%4
%设A生产产品1为x1，生产产品2为x2，生产产品3为x3；B生产1产品为x4，生产产品2为x5，生产产品3为x6；C生产1产品为x7，生产产品2为x8，生产产品3为x9
%目标函数：maxf=4.5*(x1+x4+x7)+2*(x2+x5+x8)+2.9*(x3+x6+x9);
%约束条件：9*x1+2*x2+10*x3≤300;12*x4+5*x5+8*x6≤400;4*x7+13*x8+10*x9≤420;x1,x2,x3,x4,x5,x6,x7,x8,x9≥0.
c=[-4.5 -2 -2.9 -4.5 -2 -2.9 -4.5 -2 -2.9];
A=[9 2 10 0 0 0 0 0 0;0 0 0 12 5 8 0 0 0;0 0 0 0 0 0 4 13 10];
b=[300;400;420];
Aeq=[];
beq=[];
vlb=zeros(9,1);
vub=[];
[x fval]=linprog(c,A,b,Aeq,beq,vlb,vub)